function [ n,k1,k2 ] = cal_curvature( point )
%------------------------------------------------------------%
%这个函数只用来计算设计透镜上任意一点的曲率和法向量
% 事实上，修改A的参数，可以计算任意形状的二次面的曲率和法向量
% 在这种情况下，axx均为计算值，单位为cm
% 参考资料来自陆泽健毕业论文关于标准面参数的计算
% 刘小沛 2015.6.14
%------------------------------------------------------------%
a11=1/64;a22=-1/80;a33=-1/80;
a12=0;a13=0;a14=0;a23=0;a24=0;a34=0;a44=-1;
A=[a11,a12,a13,a14;a12,a22,a23,a24;a13,a23,a33,a34;a14,a24,a34,a44];
n=A(1:3,1:3)*point';
n=n/norm(n);%这是一种比较简单的方法，另外一种并没有采纳

x=point(1);y=point(2);z=point(3);
p=(5*x-2*y^2)/4/z;%zx
q=(5*x^2-8*y)/8/z;%zy
s=((5*x-4*y)*4*z-(5*x-2*y^2)*4*q)/16/z^2;%zxy
r=((5-2*y^2)*4*z-(5*x-2*y^2)*4*p)/16/z*2;%zxx
t=((5*x^2-8)*8*z-(5*x^2-8*y)*8*q)/64/z^2;%zyy
E=1+p^2;F=p*q;G=1+q^2;
L=r/sqrt(1+p^2+q^2);
M=s/sqrt(1+p^2+q^2);
N=t/sqrt(1+p^2+q^2);

H=0.5*(L*G-2*M*F+N*E)/(E*G-F^2);
K=(L*N-M^2)/(E*G-F^2);
k1=H+sqrt(H^2-K);
k2=H-sqrt(H^2-K);%求得的曲率与单位无关
end


